<h1>PHP foreachลูป</h1>
<p>การforeachวนซ้ำ - วนซ้ำบล็อกของรหัสสำหรับแต่ละองค์ประกอบในอาร์เรย์</p>
<p>การforeachวนซ้ำทำงานบนอาร์เรย์เท่านั้น และใช้เพื่อวนซ้ำแต่ละคู่ของคีย์//ค่าในอาร์เรย์</p>
<p>สำหรับการวนซ้ำทุกครั้ง ค่าขององค์ประกอบอาร์เรย์ปัจจุบันถูกกำหนดให้กับ $value และตัวชี้อาร์เรย์จะถูกย้ายทีละหนึ่ง จนกว่าจะถึงองค์ประกอบอาร์เรย์ตัวสุดท้าย</p>
<p>ตัวอย่างต่อไปนี้จะแสดงค่าของอาร์เรย์ที่กำหนด ($colors):</p>
<?php
echo "<font color='#FF0000'>";
$colors = array("red", "green", "blue", "yellow");

foreach ($colors as $value) {
  echo "$value <br>";
}

echo "<br><font color='#993300'>";
?>

<p>ตัวอย่างต่อไปนี้จะแสดงทั้งคีย์และค่าของอาร์เรย์ที่กำหนด ($age)</p>
<?php
echo "<font color='#993300'>";
$age = array("Peter"=>"35", "Ben"=>"37", "Joe"=>"43");

foreach($age as $x => $val) {
  echo "$x = $val<br>";
}

?>


