<?php
echo "<font color='#993300'><h1>PHP ในขณะที่วนซ้ำ</h1>";
echo "<font color='#993300'><p>การwhileวนซ้ำ - วนซ้ำบล็อกของโค้ดตราบเท่าที่เงื่อนไขที่ระบุเป็นจริง</p>";
echo "<font color='#993300'><p>ลูป while ดำเนินการบล็อกของรหัสตราบเท่าที่เงื่อนไขที่ระบุเป็นจริง</p>";
echo "<font color='#993300'><p>ตัวอย่างด้านล่างแสดงตัวเลขตั้งแต่ 1 ถึง 5</p>";
$x = 1;
while($x <= 5) {
  echo "The number is: $x <br>";
  $x++;
}

//
echo "<font color='#993300'><p>- $x = 1; - เริ่มต้นตัวนับลูป ($x) และตั้งค่าเริ่มต้นเป็น 1</p>";
echo "<font color='#993300'><p>- $x <= 5 - วนลูปต่อไปตราบเท่าที่ $x น้อยกว่าหรือเท่ากับ 5</p>";
echo "<font color='#993300'><p>- $x++; - เพิ่มค่าตัวนับลูปทีละ 1 สำหรับการวนซ้ำแต่ละครั้ง</p>";
echo "<font color='#993300'><p>ตัวอย่างนี้นับเป็น 100 คูณสิบ</p>";
$x = 0;
while($x <= 100) {
  echo "The number is: $x <br>";
  $x+=10;
}

?>
