<h1>PHP ทำ ... ในขณะที่วนซ้ำ</h1>
<p>การdo...whileวนซ้ำจะดำเนินการบล็อกของโค้ดหนึ่งครั้ง
จากนั้นจะตรวจสอบเงื่อนไขและทำซ้ำการวนซ้ำในขณะที่เงื่อนไขที่ระบุเป็นจริง</p>
<p>ตัวอย่างด้านล่าง ขั้นแรกให้ตั้งค่าตัวแปร $x เป็น 1 $x = 1 
จากนั้นลูป do while จะเขียนเอาต์พุตบางส่วน จากนั้นเพิ่มตัวแปร $x ด้วย 1 จากนั้นจึงตรวจสอบเงื่อนไข 
$x น้อยกว่าหรือเท่ากับ 5 หรือไม่ และลูปจะทำงานต่อไปตราบเท่าที่ $x น้อยกว่าหรือเท่ากับ 5</p>
<?php
$x = 1;

do {
  echo "The number is: $x <br>";
  $x++;
} while ($x <= 5);

echo "<font color='#993300'><p>หมายเหตุ:ในdo...whileลูป เงื่อนไขจะถูกทดสอบหลังจากดำเนินการคำสั่งภายในลูป ซึ่งหมายความว่าdo...whileลูปจะดำเนินการคำสั่งอย่างน้อยหนึ่งครั้ง แม้ว่าเงื่อนไขจะเป็นเท็จก็ตาม ดูตัวอย่างด้านล่าง</p>";
echo "<font color='#993300'><p>ตัวอย่างนี้ตั้งค่าตัวแปร $x เป็น 6 จากนั้นรันลูป จากนั้นตรวจสอบเงื่อนไข</p>";


$x = 6;

do {
  echo "The number is: $x <br>";
  $x++;
} while ($x <= 5);

?>